{
  "jobs": [
    {
      "company": "University of Wisconsin - Madison",
      "location": "Madison, WI",
      "title": "Coordinator of Digital Services | Application Administrator II",
      "duration": "2018 - Present",
      "description": "<p>Orchestrate technology and applications as administrator and functional lead of four enterprise-level systems for UW-Madison's Student Orientation, Advising, and Registration (SOAR) program. Drive innovation through researching, recommending, and implementing technology and application resources including Guidebook, Starfish, and Salesforce. Facilitate L1 and L2 tech support, acting as key liaison between IT services and Center for the First-Year Experience (CFYE). Guide and mentor an undergraduate intern assisting technology function of SOAR program and related applications. Ensure streamlined operations across all SOAR session programs, supporting staff as well as answering student and parent questions.</p><br /><ul><li>Spearheaded development and improvement initiatives for four enterprise systems: SOAR Reservation System, SOAR Advising Module (SAM), Preparing for SOAR, and New Student To-Do List, used by <span>thousands</span> of students and <span>hundreds</span> of staff members.</li><li>Functional project lead on creation of new student portal to curate and centralize applications as well as communications with students during transition into UW-Madison.</li><li>Directed redesign and redevelopment of SOAR Reservation System as well as SOAR Advising Module, utilizing innovative technology to address evolving growth and needs of SOAR program.</li><li>Managed streamlined transition from in-person orientation programs to online programs during COVID-19 pandemic.</li><li>Recognized as Outstanding New OTR (Orientation, Transition, and Retention) Professional by Region V of NODA (Association for Orientation, Transition, and Retention Professionals in Higher Education) in 2020.</li></ul>"
    },
    {
      "company": "University of Wisconsin - Madison",
      "location": "Madison, WI",
      "title": "Capstone Certificate in User Experience Design Student",
      "duration": "2019 - 2020",
      "description": "<p>Successfully completed program with design and development of robust prototype, including market and user research, persona development, as well as low and high-fidelity designs.</p>"
    },
    {
      "company": "Raven Software",
      "location": "Middleton, WI",
      "title": "Senior Quality Assurance Tester<br />Quality Assurance Tester",
      "duration": "2017 - 2018<br />2014 - 2017",
      "description": "<p>Managed team of testers through development milestones and releases of software for various video games. Developed test cases, content sweeps, and milestone test plans, collaborating with production teams on deadline and project requirements. Tested pre-release video games to verify functionality, data content, performance, usability/playability, as well as hardware/software compatibility. Produced detailed documentation on defects utilizing DevTrack and Jira, distributing findings and actions to design teams.</p><br /><ul><li>Significantly contributed to successful launches of <span>six</span> AAA video games in the <em>Call of Duty</em> franchise, providing key insights on designs and functions developed.</li><li>Successfully slashed required team overtime by <span>50</span>% by leveraging strategic time management and creating test plans for first time success.</li><li>Headed continuous QA support for ongoing video games with <span>millions</span> of players worldwide, including China-only Free to Play version called <em>Call of Duty Online</em> with new content and updates released monthly.</li></ul>"
    },
    {
      "company": "Vicarious Visions",
      "location": "Menands, NY",
      "title": "Senior Quality Assurance Tester<br />Quality Assurance Tester",
      "duration": "2013<br />2012-2013",
      "description": "<p>Led testing on new video games prior to launch, ensuring all specifications and requirements satisfied. Actively engaged in daily Missions (Levels) Design scrum as well as large production meetings, distributing important information to team. Managed evaluation of game reporting metrics functionality as well as play testing feedback videos and reports for further fixes and improvements. Identified issues and ran debugging programs to ensure resolution. Recorded all defects, creating and distributing reports outlining defects and processes followed to fix defects. Leveraged knowledge and expertise to assist software developers in early development stages, highlighting potential issues, assessing risks, and resolving issues before launch.</p><br /><ul><li>Spearheaded development of onboarding program for <span>20</span> incoming employees, increasing speed with which new employees understood tools and procedures for seamless transitions into roles.</li><li>Promoted to Senior QA Tester within three months due to outstanding work ethic, fast-learning capabilities, and leveraging creative thinking with testing.</li><li>Actively engaged in successful AAA title launch within the <em>Skylanders</em> franchise, ensuring player quality and functionality expectations met before launch.</li></ul>"
    },
    {
      "company": "Rensselaer Polytechnic Institute",
      "location": "Troy, NY",
      "title": "Human-Computer Interaction Masters Student",
      "duration": "2009 - 2012",
      "description": "<p>Learned innovative industry theories and procedures utilized globally in design and software implementation, with coursework in human-computer interaction combined with theory in allied areas such as technical communication, human factors, information design, cognitive science, and computer science. of Cognitive Modeling and Technical Communication. Researched and analyzed topics covered in lectures in order to acquire better understanding of concepts for application after graduation. Explored fundamental topics, including User Experience Design, Interactive Data Visualization, Information Design, User Experience Methods, and Interface Design. Performed research, led presentations, and designed and managed group projects.</p><br /><ul><li>Recipient of Founders Award for Excellence in Fall of 2011.</li><li>Membership Chair for RPI Players from Fall 2010 to Spring 2011.</li><li>Student Orientation Coordinator, Summer 2009: Led and supervised team of student advisors to facilitate RPI's Orientation programs.</li><li>Acted as Peer Advisor for Games and Simulation Arts and Sciences Undergraduate Students.</li><li>Stage Manager, Director, and Publicity Director for various theater shows.</li><li>Alpha Psi Omega - Theatrical Honor Society Member.</li></ul>"
    }
  ]
}
